#입문강의 들으면서 파이썬에서 헷갈리는 것들

###변수와 계산######################################################

a=3
b=2
###제곱
a**b


###REPL : Read-Eval-Print Loop
#읽어서 평가(실행)하고 출력하는 루프(반복)

###조건문###########################################################

###True, False 꼭 앞문자 대문자로.

###if, elif, else

###함수############################################################

###def function():

###자료형###########################################################

###"".format()

###여러줄 문자열
string = """줄바꿈도 되고 
        '따옴표 "큰따옴표 마음대로 사용
        """

###나눈 몫 : // != 나눈 값 : /


###리스트########################################################### 
list = [1, 2, 3]
list.remove(2) # 값(2) 지우기

###for반복문#######################################################
rainbow = ['R', 'O', 'Y', 'G', 'B', 'N', 'P']
for i in range(len(rainbow)):
    print(rainbow[i])

for i,color in enumerate(rainbow): #enumerate : 리스트의 순서와 값을 반환
    print('{}번째 색은 {}'.format(i+1,color))

###모듈#############################################################
import math
math.pi

###활용하기#########################################################
import random

###딕셔너리와 튜플##################################################

###딕셔너리 값 제거
days_in_month = {"1월":31, "2월":28, "3월":31,"-1월":97889789}
del(days_in_month['-1월'])
days_in_month.pop('-1월')

###딕셔너리 반복문
days_in_month = {"1월":31, "2월":28, "3월":31, "4월":30, "5월":31}

for i in days_in_month.keys() : #.keys() : 이름표들, .values() : 값들
    print(i)
#둘 다 가져와야 할 땐 .items()

###dict1에 dict2합칠때 
dict1.update(dict2)

###튜플
ages = {'Tod' : 35, 'Jane' : 23, 'Paul' : 62}

for a in ages.items():
    print('{}의 나이는:{}'.format(a[0], a[1]))

for a in ages.items():
    print('{}의 나이는:{}'.format(*a))    # 두 출력 결과가 같습니다.


###while문과 반복 제어##############################################


###예외처리#########################################################

